task-tracker-1c/src/Catalogs/тз_ПрофилиЗаданий/тз_ПрофилиЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тз_ПрофилиЗаданий</name>
  <predefined>
    <items>
      <name>ОсновнойПрофиль</name>
      <description>Основной профиль</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксЗаданий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеВидыАналитик</name>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.тз_ВидыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Characteristic.тз_ВидыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВСписке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеВидыЗаданий</name>
    <attributes>
      <name>ВидЗадания</name>
      <type>
        <types>CatalogRef.тз_ВидыЗаданий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСостоянияЗаданий</name>
    <attributes>
      <name>СостояниеЗадания</name>
      <type>
        <types>CatalogRef.тз_СостоянияЗаданий</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>DefinedType.тз_Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеПроекты</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.тз_Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответсвенный</name>
      <type>
        <types>DefinedType.тз_Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеПриоритеты</name>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>CatalogRef.тз_Приоритеты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

task-tracker-1c/src/Catalogs/тз_СостоянияЗаданий/тз_СостоянияЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тз_СостоянияЗаданий</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Завершено</name>
      <description>Завершено</description>
    </items>
    <items>
      <name>Новое</name>
      <description>Новое</description>
    </items>
  </predefined>
  <attributes>
    <name>СтатусВыполнения</name>
    <type>
      <types>EnumRef.тз_СтатусыВыполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

task-tracker-1c/src/Catalogs/тз_Приоритеты/тз_Приоритеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тз_Приоритеты</name>
  <predefined>
    <items>
      <name>Высокий</name>
      <description>Высокий</description>
    </items>
    <items>
      <name>Низкий</name>
      <description>Низкий</description>
    </items>
    <items>
      <name>Средний</name>
      <description>Средний</description>
    </items>
  </predefined>
</mdclass:Catalog>

task-tracker-1c/src/Catalogs/тз_ПрофилиЗаданий/ManagerModule.bsl
Процедура ВыполнитьПервоначальноеЗаполнение(Отказ = Ложь) Экспорт
	
	// Заполним шапку.
	ПредопределенныйЭлемент = Справочники.тз_ПрофилиЗаданий.ОсновнойПрофиль.ПолучитьОбъект();
	ПредопределенныйЭлемент.НаименованиеПолное = НСтр("ru='Основной профиль'");
	ПредопределенныйЭлемент.ПрефиксЗаданий = "ТЗ";
	
	// Заполним доступные состояния.
	СтрокаСостояния = ПредопределенныйЭлемент.ДоступныеСостоянияЗаданий.Добавить();
	СтрокаСостояния.СостояниеЗадания = Справочники.тз_СостоянияЗаданий.Новое;
	
	СтрокаСостояния = ПредопределенныйЭлемент.ДоступныеСостоянияЗаданий.Добавить();
	СтрокаСостояния.СостояниеЗадания = Справочники.тз_СостоянияЗаданий.ВРаботе;
	
	СтрокаСостояния = ПредопределенныйЭлемент.ДоступныеСостоянияЗаданий.Добавить();
	СтрокаСостояния.СостояниеЗадания = Справочники.тз_СостоянияЗаданий.Завершено;
	
	// Заполним доступные приоритеты.
	СтрокаСостояния = ПредопределенныйЭлемент.ДоступныеПриоритеты.Добавить();
	СтрокаСостояния.Приоритет = Справочники.тз_Приоритеты.Низкий;
	
	СтрокаСостояния = ПредопределенныйЭлемент.ДоступныеПриоритеты.Добавить();
	СтрокаСостояния.Приоритет = Справочники.тз_Приоритеты.Средний;
	
	СтрокаСостояния = ПредопределенныйЭлемент.ДоступныеПриоритеты.Добавить();
	СтрокаСостояния.Приоритет = Справочники.тз_Приоритеты.Высокий;
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенный профиль:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьПереченьСостоянийЗаданий(Профиль, Состояния) Экспорт

	Если ТипЗнч(Состояния)=Тип("СписокЗначений") Тогда
		Состояния.Очистить();
	Иначе
		Состояния = Новый СписокЗначений();
	КонецЕсли;
	
	Если Профиль.ДоступныеСостоянияЗаданий.Количество() > 0 Тогда
		Состояния.ЗагрузитьЗначения(Профиль.ДоступныеСостоянияЗаданий.ВыгрузитьКолонку("СостояниеЗадания"));
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	тз_СостоянияЗаданий.Ссылка КАК Ссылка,
			|	тз_СостоянияЗаданий.Представление КАК Представление
			|ИЗ
			|	Справочник.тз_СостоянияЗаданий КАК тз_СостоянияЗаданий";
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Состояния.Добавить(Выборка.Ссылка, Выборка.Представление);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Состояния;
	
КонецФункции // ПолучитьПереченьСостоянийЗаданий()

Функция ПолучитьПереченьПриоритетов(Профиль, Приоритеты) Экспорт

	Если ТипЗнч(Приоритеты)=Тип("СписокЗначений") Тогда
		Приоритеты.Очистить();
	Иначе
		Приоритеты = Новый СписокЗначений();
	КонецЕсли;
	
	Если Профиль.ДоступныеПриоритеты.Количество() > 0 Тогда
		Приоритеты.ЗагрузитьЗначения(Профиль.ДоступныеПриоритеты.ВыгрузитьКолонку("Приоритет"));
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	тз_Приоритеты.Ссылка КАК Ссылка,
			|	тз_Приоритеты.Представление КАК Представление
			|ИЗ
			|	Справочник.тз_Приоритеты КАК тз_Приоритеты";
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Приоритеты.Добавить(Выборка.Ссылка, Выборка.Представление);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Приоритеты;
	
КонецФункции // ПолучитьПереченьСостоянийЗаданий()

Функция ПолучитьПереченьВидовЗаданий(Профиль, ВидыЗаданий = Неопределено, ПолученВесьСправочник = Ложь) Экспорт
	
	НужноЗаполнятьСписок = ВидыЗаданий <> Неопределено;
	Если НужноЗаполнятьСписок И ТипЗнч(ВидыЗаданий)=Тип("СписокЗначений") Тогда
		ВидыЗаданий.Очистить();
	Иначе
		ВидыЗаданий = Новый СписокЗначений();
	КонецЕсли;
	
	МассивВидовЗаданий = Новый Массив;
	Если  Профиль.ДоступныеВидыЗаданий.Количество() > 0 Тогда
		МассивВидовЗаданий = Профиль.ДоступныеВидыЗаданий.ВыгрузитьКолонку("ВидЗадания");
		Если НужноЗаполнятьСписок Тогда
			ВидыЗаданий.ЗагрузитьЗначения(МассивВидовЗаданий);
		КонецЕсли;
	Иначе
		ПолученВесьСправочник = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	тз_ВидыЗаданий.Ссылка КАК Ссылка,
			|	тз_ВидыЗаданий.Представление КАК Представление
			|ИЗ
			|	Справочник.тз_ВидыЗаданий КАК тз_ВидыЗаданий";
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивВидовЗаданий.Добавить(Выборка.Ссылка);
			Если НужноЗаполнятьСписок Тогда
				ВидыЗаданий.Добавить(Выборка.Ссылка, Выборка.Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВидовЗаданий;
	
КонецФункции // ПолучитьПереченьСостоянийЗаданий()

Функция ПолучитьПереченьПроектов(Профиль, СписокПроектов = Неопределено) Экспорт

	НужноЗаполнятьСписок = СписокПроектов <> Неопределено;
	Если НужноЗаполнятьСписок И ТипЗнч(СписокПроектов)=Тип("СписокЗначений") Тогда
		СписокПроектов.Очистить();
	Иначе
		СписокПроектов = Новый СписокЗначений();
	КонецЕсли;
	
	МассивПроектов = Новый Массив;
	Если Профиль.ДоступныеПроекты.Количество() > 0 Тогда
		МассивПроектов = Профиль.ДоступныеПроекты.ВыгрузитьКолонку("Проект");
		Если НужноЗаполнятьСписок Тогда
			СписокПроектов.ЗагрузитьЗначения(МассивПроектов);
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Проекты.Ссылка КАК Ссылка,
			|	Проекты.Представление КАК Представление
			|ИЗ
			|	Справочник.&Проект КАК Проекты";
		
		ТипОпределяемогоПроектаСтрокой = Метаданные.НайтиПоТипу(Метаданные.ОпределяемыеТипы.тз_Проекты.Тип.Типы()[0]).Имя;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Проект", ТипОпределяемогоПроектаСтрокой);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивПроектов.Добавить(Выборка.Ссылка);
			Если НужноЗаполнятьСписок Тогда
				СписокПроектов.Добавить(Выборка.Ссылка, Выборка.Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивПроектов;
	
КонецФункции // ПолучитьПереченьПроектов()
